Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/documenting.tmx
Source language: en
Languages: pl

source: Building the documentation
pl: Budowanie dokumentacji

source: You need to have Python 2.4 or higher installed; the toolset used to build the docs is written in Python. It is called *Sphinx*, it is not included in this tree, but maintained separately. Also needed are the docutils, supplying the base markup that Sphinx uses, Jinja, a templating engine, and optionally Pygments, a code highlighter.
pl: Musisz mieć zainstalowany język pytonowski w wersji 2.4 lub wyższej; zestaw narzędziowy używany do budowy dokumentów napisany jest w języku pytonowskim. Zwany jest *Sphinx*, nie jest załączony w tym drzewie, ale utrzymywany osobnol Także potrzebne są docutils, zapewniające bazowe tagi których używa Sphinx, Jinja - maszyna wzorcująca i nieobowiązkowo Pygments, do podświetlania kodu.

source: Using make
pl: Używanie make

source: Luckily, a Makefile has been prepared so that on Unix, provided you have installed Python and Subversion, you can just run ::
pl: Szczęśliwie plik Makefile został przygotowany tak, że na Unix-ie zapewniwszy że masz zainstalowany język pytonowski i Subversion, możesz po prostu uruchomić ::

source: to check out the necessary toolset in the `tools/` subdirectory and build the HTML output files. To view the generated HTML, point your favorite browser at the top-level index `build/html/index.html` after running "make".
pl: aby odpisać konieczne zestawy narzędziowe w podkatalogu `tools/` i zbudować pliki wyjściowe HTML. Aby zobaczyć wygenerowany HTML, wskaż swojej ulubionej przeglądarce głównego poziomu indeks `build/html/index.html` po uruchomieniu "make".

source: Available make targets are:
pl: Dostępne punkty docelowe polecenia make to:

source: "html", which builds standalone HTML files for offline viewing.
pl: "html", który buduje samodzielne pliki HTML do czytania bez podłączania do internetu.

source: "htmlhelp", which builds HTML files and a HTML Help project file usable to convert them into a single Compiled HTML (.chm) file -- these are popular under Microsoft Windows, but very handy on every platform.
pl: "htmlhelp", który buduje pliki HTML i plik projektu HTML Help ( - z ang. - Pomoc HTML ) - użyteczny do zamiany ich do pojedynczego skompilowanego pliku HTML (.chm) -- te są bardziej popularne w Microsoft Windows, ale także bardzo poręczne na każdej maszynie/środowisku.

source: To create the CHM file, you need to run the Microsoft HTML Help Workshop over the generated project (.hhp) file.
pl: Aby utworzyć plik CHM, potrzeba uruchomić skrzynkę narzędziową HTML Help ponad utworzonym plikiem projektu (.hhp).

source: "latex", which builds LaTeX source files as input to "pdflatex" to produce PDF documents.
pl: "latex", który buduje pliki źródłowe LaTeX jako pliki wejściowe dla polecenia "pdflatex" aby utworzyć dokumenty PDF.

source: "text", which builds a plain text file for each source file.
pl: "text", które budują czysto tekstowe pliki dla każdego pliku źródłowego.

source: "linkcheck", which checks all external references to see whether they are broken, redirected or malformed, and outputs this information to stdout as well as a plain-text (.txt) file.
pl: "linkcheck", które sprawdza wszystkie zewnętrzne odwołania aby sprawdzić czy nie są błędne, przekierowane lub pomylone, i wypisuje tą informację na standardowe wyjście zarówno jak też do pliku czysto-tekstowego (.txt).

source: "changes", which builds an overview over all versionadded/versionchanged/ deprecated items in the current version. This is meant as a help for the writer of the "What's New" document.
pl: "changes", który buduje przegląd ponad wszystkimi nowymi w tej wersji/ zmienionymi w tej wersji/ przestarzałymi elementami w obecnej wersji. To jest pomyślane jako pomoc dla piszącego dokument "Co Nowego".

source: "coverage", which builds a coverage overview for standard library modules and C API.
pl: "coverage", który buduje przegląd pokrycia dla modułów standardowej biblioteki i sprzęgów programowania C.

source: "pydoc-topics", which builds a Python module containing a dictionary with plain text documentation for the labels defined in `tools/sphinxext/pyspecific.py` -- pydoc needs these to show topic and keyword help.
pl: "pydoc-topics", które buduje moduł języka pytonowskiego zawierający słownik z czysto-tekstową dokumentacją dla fiszek określonych w `tools/sphinxext/pyspecific.py` -- pydoc potrzebuje tych do pokazania tematów pomocy i pomocy według słów kluczowych.

source: A "make update" updates the Subversion checkouts in `tools/`.
pl: "make update" uaktualnia wypisy z Subversion w `tools/`.

source: Without make
pl: Bez make

source: You'll need to install the Sphinx package, either by checking it out via ::
pl: Potrzebujesz zainstalować pakiet Sphinxa, uzyskując odpis przez ::

source: or by installing it from PyPI.
pl: lub przez zainstalowanie go z PyPI.

source: Then, you need to install Docutils, either by checking it out via ::
pl: Wtedy potrzebujesz Docutils, uzyskując odpis przez ::

source: or by installing it from http://docutils.sf.net/.
pl: lub instalując go z http://docutils.sf.net/.

source: You also need Jinja2, either by checking it out via ::
pl: Potrzebujesz także Jinja2, albo przez odpis przez ::

source: You can optionally also install Pygments, either as a checkout via ::
pl: Możesz także opcjonalnie zainstalować Pygments, albo przez odpis przez ::

source: or from PyPI at http://pypi.python.org/pypi/Pygments.
pl: albo z PyPI z http://pypi/python.org/pypi/Pygments.

source: Then, make an output directory, e.g. under `build/`, and run ::
pl: Potem tworząc wynikowy katalog, np pod `build/`, i uruchamiając ::

source: where `<builder>` is one of html, text, latex, or htmlhelp (for explanations see the make targets above).
pl: gdzie `<builder>` jest jednym z html, text, latex, lub htmlhelp (dla wyjaśnień zobacz punkty docelowe polecenia make powyżej).

source: Differences to the LaTeX markup
pl: Różnice w adnotacjach LaTeX

source: Though the markup language is different, most of the concepts and markup types of the old LaTeX docs have been kept -- environments as reST directives, inline commands as reST roles and so forth.
pl: Chociaż język adnotacji jest różny, większość koncepcji i typów adnotacji starych dokumentów LaTeX została zachowana -- środowiska jako dyrektywy reST, komendy inline jako role reST itd.

source: However, there are some differences in the way these work, partly due to the differences in the markup languages, partly due to improvements in Sphinx. This section lists these differences, in order to give those familiar with the old format a quick overview of what they might run into.
pl: Jednakże, istnieją pewne różnice w sposobie w jaki te działają, po części w zależności od różnic w językach adnotacji, po części w zależności od ulepszeń Sphinxa. Ten rozdział opisuje te różnice, w celu aby dać znającym stary format szybki ogląd tego na co mogą natrafić.

source: Inline markup
pl: adnotacje "w-jednej-linii" ( - z ang. - inline)

source: These changes have been made to inline markup:
pl: Te zmiany zostały wprowadzone do adnotacji w-jednej-linii:

source: **Cross-reference roles**
pl: **role krzyżowych-odwołań**

source: Most of the following semantic roles existed previously as inline commands, but didn't do anything except formatting the content as code. Now, they cross-reference to known targets (some names have also been shortened):
pl: Większość z następujących ról składniowych istniało przedtem jako polecenia jednej-linii ( - z ang. - inline ), ale nie robiły nic poza formatowaniem treści jako kodu. Teraz one krzyżowo-odwołują się do znanych celów (niektóre nazwy zostały także skrócone):

source: *mod* (previously *refmodule* or *module*)
pl: *mod* (pakiet, moduł - poprzednio *refmodule* lub *module*)

source: *func* (previously *function*)
pl: *func* (zadanie poprzednio *function*)

source: *data* (new)
pl: *data* (nowe)

source: *meth* (previously *method*)
pl: *meth* (sposób postępowania - poprzednio *method*)

source: *attr* (previously *member*)
pl: *attr* (właściwość poprzednio członek - z ang. - *member*)

source: *exc* (previously *exception*)
pl: *exc* (poprzednio *exception* - z ang. - wyjątek)

source: *cfunc* (previously *cfunction*)
pl: *cfunc* (zadanie c *cfunction*)

source: *cmacro* (previously *csimplemacro*)
pl: *cmacro* (makropolecenie poprzednio *csimplemacro* - z ang. - proste makro C)

source: Also different is the handling of *func* and *meth*: while previously parentheses were added to the callable name (like ``\func{str()}``), they are now appended by the build system -- appending them in the source will result in double parentheses. This also means that ``:func:`str(object)``` will not work as expected -- use ````str(object)```` instead!
pl: Także inna jest obsługa *func* i *meth*: podczas gdy pierwotnie nawiasy były dodawane do wywoływanej nazwy (jak ``\func{str()}``), teraz są one dodawane przez system budowania -- dodawanie ich w źródle spowoduje podwójne nawiasy. To także oznacza że ``:func:`str(przedmiot)``` nie zadziała jak oczekiwano -- użyj ````str(przedmiot)```` zamiast tego.

source: **Inline commands implemented as directives**
pl: **polecenia w-jednej-linii wypełnione jako dyrektywy**

source: These were inline commands in LaTeX, but are now directives in reST:
pl: Te były poleceniami w-jednej-linii w LaTeX-ie, ale teraz są dyrektywami w reST:

source: *deprecated*
pl: *przestarzałe* ( - z ang. - *deprecated*)

source: *versionadded*
pl: *wersja_dodana* ( - z ang. - *versionadded*)

source: *versionchanged*
pl: *wersja_zmieniona* ( - z ang. - *versionchanged*)

source: These are used like so::
pl: Te są używane jako takie::

source: .. deprecated:: 2.5 Reason of deprecation.
pl: .. przestarzałe:: 2.5 Powód przedawnienia.

source: Also, no period is appended to the text for *versionadded* and *versionchanged*.
pl: Także nie jest dodawana kropka do tekstu dla *versionadded* i *versionchanged* ( - z ang. - *wersjadodana*, *wersjazmieniona* ).

source: *note*
pl: *uwagi* ( - z ang. - *note*)

source: *warning*
pl: *ostrzeżenia* ( - z ang. - *warning*)

source: .. note:: Content of note.
pl: .. note:: Treść uwag.

source: **Otherwise changed commands**
pl: **W inny sposób zmienione polecenia**

source: The *samp* command previously formatted code and added quotation marks around it. The *samp* role, however, features a new highlighting system just like *file* does:
pl: Polecenie *samp* poprzednio formatowany kod i dodawane znaki cytowania wokół niego. Rola *samp* jednakże wyszczególnia nowy system podświetlania tak jak to dotyczy plików ( - z ang. - *file*) :

source: ``:samp:`open({filename}, {mode})``` results in :samp:`open({filename}, {mode})`
pl: ``:samp:`open({filename}, {mode})``` daje w rezultacie :samp:`open({filename}, {mode})` (gdzie samp - z ang. - przykład, filename - nazwa pliku, mode - tryb)

source: **Dropped commands**
pl: **Pominięte polecenia**

source: These were commands in LaTeX, but are not available as roles:
pl: Te były poleceniami w LaTeX, ale nie są teraz dostępne jako role:

source: *bfcode*
pl: *bfcode* - z ang. - kodbf

source: *character* (use :samp:`\`\`'c'\`\``)
pl: *character* (użyj :samp:`\`\`'c'\`\``)

source: *citetitle* (use ```Title <URL>`_``)
pl: *citetitle* (użyj ```Tytuł <adres url>`_``)

source: *code* (use ````code````)
pl: *code* (użyj ````code````)

source: *email* (just write the address in body text)
pl: *email* (po prostu napisz adres w treści tekstu)

source: *filevar* (use the ``{...}`` highlighting feature of *file*)
pl: *filevar* (użyj ``{...}`` własności podświetlania pliku - z ang. - *file*)

source: *programopt*, *longprogramopt* (use *option*)
pl: *programopt*, *longprogramopt* (użyj opcji - z ang. - *option*)

source: *ulink* (use ```Title <URL>`_``)
pl: *ulink* (użyj ```Tytuł <adres url>`_``)

source: *url* (just write the URL in body text)
pl: *url* (po prostu napisz adres url w treści tekstu)

source: *var* (use ``*var*``)
pl: *var* (użyj ``*var*``)

source: *infinity*, *plusminus* (use the Unicode character)
pl: *infinity*, *plusminus* (użyj znaku Unicode)

source: *shortversion*, *version* (use the ``|version|`` and ``|release|`` substitutions)
pl: *shortversion*, *version* (użyj podstawienia ``|version|`` i ``|release|``)

source: *emph*, *strong* (use the reST markup)
pl: *emph*, *strong* (użyj adnotacji reST)

source: **Backslash escaping**
pl: **Ucieczkowanie skośnikiem**

source: In reST, a backslash must be escaped in normal text, and in the content of roles. However, in code literals and literal blocks, it must not be escaped. Example: ``:file:`C:\\Temp\\my.tmp``` vs. ````open("C:\Temp\my.tmp")````.
pl: W reST, skośnik musi być ucieczkowany w zwykłym tekście, i treści ról. Jednakże, w literałach kodu i blokach literałów, nie musi być ucieczkowany. Na przykład: ``:file:`C:\Temp\my.tmp``` vs. ````open("C:\Temp\my.tmp")````.

source: Information units
pl: jednostki informacji

source: Information units (*...desc* environments) have been made reST directives. These changes to information units should be noted:
pl: Jednostki informacji (środowiska *...desc*) zostały przemianowane dyrektywami reST. Te zmiany do jednostek informacji powinny być odnotowane:

source: **New names**
pl: **Nowe nazwy**

source: "desc" has been removed from every name. Additionally, these directives have new names:
pl: "desc" zostało zdjęte z każdej nazwy. Dodatkowo, te dyrektywy mają nowe nazwy:

source: *cfunction* (previously *cfuncdesc*)
pl: *cfunction* (przedtem *cfuncdesc*)

source: *cmacro* (previously *csimplemacrodesc*)
pl: *cmacro* (poprzednio *csimplemacrodesc*)

source: *exception* (previously *excdesc*)
pl: *exception* (poprzednio *excdesc*)

source: *function* (previously *funcdesc*)
pl: *function* (poprzednio *funcdesc*)

source: *attribute* (previously *memberdesc*)
pl: *attribute* (poprzednio *memberdesc*)

source: The *classdesc\** and *excclassdesc* environments have been dropped, the *class* and *exception* directives support classes documented with and without constructor arguments.
pl: środowiska *classdesc\** i *exclassdesc* zostały pominięte na rzecz dyrektyw *class* i *exception* wspierających klasy udokumentowane z i bez parametrów konstruktora.

source: **Multiple objects**
pl: **Wielokrotne przedmioty**

source: The equivalent of the *...line* commands is::
pl: Równoważne polecenie dla *...line* ::

source: .. function:: do_foo(bar) do_bar(baz) Description of the functions.
pl: .. function:: do_foo(bar) do_bar(baz) Opis zadania.

source: IOW, just give one signatures per line, at the same indentation level.
pl: IOW, po prostu daj jedną sygnaturę na linię, na tym samym poziomie wcięcia.

source: **Arguments**
pl: **Parametry**

source: There is no *optional* command. Just give function signatures like they should appear in the output::
pl: Nie ma polecenia *optional*. Po prostu dawaj sygnatury zadan tak jak powinny się one pojawić w wyjściu::

source: Note: markup in the signature is not supported.
pl: Zauważ: adnotacje w sygnaturze nie są wspierane

source: **Indexing**
pl: **Indeksowanie**

source: The *...descni* environments have been dropped. To mark an information unit as unsuitable for index entry generation, use the *noindex* option like so::
pl: środowiska *...descni* zostały pominięte. Aby oznaczyć jednostkę informacji jako niezdatną dla generacji wpisu indeksowania, użyj opcji *noindex* jako takiej::

source: .. function:: foo_* :noindex: Description.
pl: .. function:: foo_* :noindex: Opis.

source: **New information units**
pl: **Nowe jednostki informacji**

source: There are new generic information units: One is called "describe" and can be used to document things that are not covered by the other units::
pl: Istnieją nowe generyczne jednostki informacji: Jedna jest zwana "describe" i może być używana do udokumentowania rzeczy które nie są pokryte przez inne jednostki::

source: .. describe:: a == b The equals operator.
pl: .. describe:: a==b Operator równości.

source: The others are::
pl: Inne to::

source: .. cmdoption:: -O Describes a command-line option. .. envvar:: PYTHONINSPECT Describes an environment variable.
pl: .. cmdoption:: -O Opisuje opcję wiersza polecenia. .. envvar:: PYTHONINSPECT Opisuje zmienną środowiskową.

source: Structure
pl: Struktura

source: The LaTeX docs were split in several toplevel manuals. Now, all files are part of the same documentation tree, as indicated by the *toctree* directives in the sources (though individual output formats may choose to split them up into parts again). Every *toctree* directive embeds other files as subdocuments of the current file (this structure is not necessarily mirrored in the filesystem layout). The toplevel file is :file:`contents.rst`.
pl: dokumenty LaTeX zostały podzielone na kilka podręczników górnego poziomu. Teraz wszystkie pliki są częścią tego samego drzewa dokumentacji, jak pokazano w dyrektywach *toctree* w źródłach (chociaż indywidualne formaty wyjściowe mogą wybrać aby podzielić je na części raz jeszcze). Każda dyrektywa *toctree* zawiera inne pliki jako poddokumenty obecnego pliku (ta struktura nie jest koniecznie odwzorowaniem rozkładu systemu plików). Nadrzędnym plikiem jest :file:`contents.rst`.

source: However, most of the old directory structure has been kept, with the directories renamed as follows:
pl: Jednakże, większość starej struktury katalogów została utrzymana, z katalogami o pozmienianych nazwach w następujący sposób:

source: :file:`dist` -> :file:`distutils`, with the single TeX file split up
pl: :file:`dist` -> :file:`distutils`, z pojedynczym plikiem TeX podzielonym

source: :file:`mac` -> merged into :file:`library`, with :file:`mac/using.tex` moved to :file:`using/mac.rst`
pl: :file:`mac` -> złączone w plik :file:`library`, z :file:`mac/using.tex` przesuniętym do :file:`using/mac.rst`

source: :file:`tut` -> :file:`tutorial`, with the single TeX file split up
pl: :file:`tut` -> :file:`tutorial`, z pojedynczym plikiem TeX podzielonym

source: Documenting Python
pl: Dokumentowanie Pythona

source: The Python language has a substantial body of documentation, much of it contributed by various authors. The markup used for the Python documentation is `reStructuredText`_, developed by the `docutils`_ project, amended by custom directives and using a toolset named `Sphinx`_ to postprocess the HTML output.
pl: Język pytonowski ma istotny zbiór dokumentacji, większość z której wytworzonej przez różnych autorów. Adnotacje używane w dokumentacji języka pytonowskiego są w formacie `reStructuredText`_ wytworzonym w projekcie `docutils`_, uzupełnionym szczególnymi dyrektywami i używając zestawu narzędziowego zwanego `Sphinx`_ do utrzymania plików wyjściowych HTML.

source: This document describes the style guide for our documentation as well as the custom reStructuredText markup introduced by Sphinx to support Python documentation and how it should be used.
pl: Ten dokument opisuje przewodnik stylu dla tej dokumentacji zarówno jak też szczegóły adnotacji reStructuredText wprowadzonych przez Sphinx-a aby wspierać dokumentację języka pytonowskiego i to jak powinien być użyty.

source: If you're interested in contributing to Python's documentation, there's no need to write reStructuredText if you're not so inclined; plain text contributions are more than welcome as well. Send an e-mail to docs@python.org or open an issue on the :ref:`tracker <reporting-bugs>`.
pl: Jeśli interesujesz się dołożeniem się do dokumentacji języka pytonowskiego nie musisz pisać reStructuredText jeśli nie chcesz; wkład zwykłym tekstem jest więcej niż mile widziany na równi. Wyślij e-mail na docs@python.org lub otwórz temat na :ref:`tracker <reporting-bugs>`.

source: Introduction
pl: Wprowadzenie

source: Python's documentation has long been considered to be good for a free programming language. There are a number of reasons for this, the most important being the early commitment of Python's creator, Guido van Rossum, to providing documentation on the language and its libraries, and the continuing involvement of the user community in providing assistance for creating and maintaining documentation.
pl: Dokumentacja języka pytonowskiego od dawna jest uważana za dobrą dla wolnego języka programowania. Istnieje pewna liczba powodów dla tego stanu rzeczy, z których najważniejszym jest wczesne przekonanie twórcy języka pytonowskiego Guido van Rossum-a, aby dostarczyć dokumentację do języka i jego bibliotek, i niesłabnące zaangażowanie społeczności użytkowników w dostarczaniu wsparcia dla tworzenia i utrzymania dokumentacji.

source: The involvement of the community takes many forms, from authoring to bug reports to just plain complaining when the documentation could be more complete or easier to use.
pl: Zaangażowanie społeczności przybiera różną postać od autorstwa po raporty o błędach skończywszy na skargach gdy dokumentacja mogłaby być bardziej kompletna lub łatwiejsza w użyciu.

source: This document is aimed at authors and potential authors of documentation for Python. More specifically, it is for people contributing to the standard documentation and developing additional documents using the same tools as the standard documents. This guide will be less useful for authors using the Python documentation tools for topics other than Python, and less useful still for authors not using the tools at all.
pl: Ten dokument jest przeznaczony dla autorów i potencjalnych autorów dokumentacji dla języka pytonowskiego. Bardziej szczegółowo, jest dla ludzi dających wkład do standardowej dokumentacji i wytwarzających dodatkowe dokumenty używając tych samych narzędzi jak standardowe dokumenty. Ten przewodnik będzie mniej użyteczny dla autorów używających narzędzi dokumentacji języka pytonowskiego przy tematach innych niż język pytonowski i mniej użyteczny wciąż dla autorów nie używających narzędzi wcale.

source: If your interest is in contributing to the Python documentation, but you don't have the time or inclination to learn reStructuredText and the markup structures documented here, there's a welcoming place for you among the Python contributors as well. Any time you feel that you can clarify existing documentation or provide documentation that's missing, the existing documentation team will gladly work with you to integrate your text, dealing with the markup for you. Please don't let the material in this document stand between the documentation and your desire to help out!
pl: Jeśli twoim zainteresowaniem jest wkład w dokumentację języka pytonowskiego, ale nie masz czasu ani zacięcia uczyć się reStructuredText i struktur adnotacji opisanych tutaj, jest przyjemne miejsce dla ciebie pomiędzy współtwórcami języka pytonowskiego również. Jeśli kiedykolwiek poczujesz, że możesz wyjaśnić istniejącą dokumentację lub dostarczyć dokumentację której brak, zespół opiekujący się istniejącą dokumentacją chętnie będzie pracował z tobą aby zintegrować twój tekst, biorąc adnotacje na siebie. Uprasza się aby materiały w tym dokumencie nie stały pomiędzy dokumentacją a twoją ochotą aby służyć pomocą

source: Additional Markup Constructs
pl: Dodatkowe konstrukcje adnotacji

source: Sphinx adds a lot of new directives and interpreted text roles to standard reST markup. This section contains the reference material for these facilities. Documentation for "standard" reST constructs is not included here, though they are used in the Python documentation.
pl: Sphinx dodaje mnóstwo nowych dyrektyw i interpretowanych ról tekstowych do standardowych adnotacji reST. Ten rozdział zawiera podręczny zestaw odniesień do tych spraw. Dokumentacja do "standardowych" konstrukcji reST nie jest tu zamieszczona, chociaż jest używana w dokumentacji języka pytonowskiego.
